SpeechsterInnovations/Speechster_ESP32-H2-Testing/Speechster-ESP32-S3-PR1/Main-Working/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_IDLE_HOOK=y

# Bluetooth
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_TASK_STACK_SIZE=4096
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517

# ADC
CONFIG_ADC_CAL_EFUSE_TP_ENABLE=y

# Logging / UART
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_USB_CDC=n
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Power / WDT
CONFIG_PM_ENABLE=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15

# Compiler / Optimization
CONFIG_COMPILER_OPTIMIZATION_LEVEL_RELEASE=y
